{
  "_name_or_path": "ESGBERT/EnvironmentalBERT-base",
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "None",
    "1": "Storm",
    "2": "Flood",
    "3": "Heatwave",
    "4": "Drought",
    "5": "Wildfire",
    "6": "Coldwave"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Coldwave": 6,
    "Drought": 4,
    "Flood": 2,
    "Heatwave": 3,
    "None": 0,
    "Storm": 1,
    "Wildfire": 5
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 6,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "multi_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.44.2",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50265
}
