{
  "_class_name": "VQModel",
  "_diffusers_version": "0.17.1",
  "act_fn": "silu",
  "block_out_channels": [
    8,
    16,
    16
  ],
  "down_block_types": [
    "DownEncoderBlock2D",
    "AttnDownEncoderBlock2D",
    "AttnDownEncoderBlock2D"
  ],
  "in_channels": 1,
  "latent_channels": 1,
  "layers_per_block": 1,
  "norm_num_groups": 8,
  "norm_type": "group",
  "num_vq_embeddings": 64,
  "out_channels": 1,
  "sample_size": [
    80,
    80
  ],
  "scaling_factor": 0.18215,
  "up_block_types": [
    "UpDecoderBlock2D",
    "AttnUpDecoderBlock2D",
    "AttnUpDecoderBlock2D"
  ],
  "vq_embed_dim": 32
}
